# Final Project

In [1]:
%load_ext lab_black

In [4]:
import jupyterhub
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
jupyterhub

### Exploring datasets:

In [6]:
locations_df = pd.read_csv("Locations.csv")
tanks_df = pd.read_csv("Tanks.csv")
Invoices_df = pd.read_csv("Invoices.csv")
fuel_level_1_df = pd.read_csv("Fuel_Level_Part_1.csv")
fuel_level_2_df = pd.read_csv("Fuel_Level_Part_2.csv")

#### Locations.csv

In [4]:
locations_df.head()

,Gas Station Location,Gas Station Name,Gas Station Address,Gas Station Latitude,Gas Station Longitude
0,1,EastMount,"386 Upper Gage Ave, Hamilton, ON L8V 4H9, Canada",43.234670,-79.836510
1,2,Eastgate,"75 Centennial Pkwy N E5, Hamilton, ON L8E 2P2,...",43.230700,-79.763930
2,3,Central,"80 Park St N, Hamilton, ON L8R 2M9, Canada",43.260260,-79.870580
3,4,Chedoke,"16 McMaster Ave, Dundas, ON L9H 0A8, Canada",43.261849,-79.937057
4,5,Mountain View,"985 Scenic Dr, Hamilton, ON L9C 1H7, Canada",43.244910,-79.921850

In [5]:
locations_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Gas Station Location   8 non-null      int64
 1   Gas Station Name       8 non-null      object
 2   Gas Station Address    8 non-null      object
 3   Gas Station Latitude   8 non-null      float64
 4   Gas Station Longitude  8 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 448.0+ bytes

In [6]:
locations_df.isna().sum()

Gas Station Location     0
Gas Station Name         0
Gas Station Address      0
Gas Station Latitude     0
Gas Station Longitude    0
dtype: int64

#### Tanks.csv

In [7]:
tanks_df.head()

  Tank ID  Tank Location  Tank Number Tank Type  Tank Capacity
0    T 10              1            1         U          40000
1    T 11              1            2         U          40000
2    T 12              1            3         D          40000
3    T 13              1            4         P          40000
4    T 14              1            5         U          40000

In [8]:
tanks_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Tank ID        23 non-null     object
 1   Tank Location  23 non-null     int64
 2   Tank Number    23 non-null     int64
 3   Tank Type      23 non-null     object
 4   Tank Capacity  23 non-null     int64
dtypes: int64(3), object(2)
memory usage: 1.0+ KB

In [9]:
tanks_df.isna().sum()

Tank ID          0
Tank Location    0
Tank Number      0
Tank Type        0
Tank Capacity    0
dtype: int64

#### Invoices.csv

In [10]:
Invoices_df.head()

,Invoice Date,Invoice ID,Invoice Gas Station Location,Gross Purchase Cost,Amount Purchased,Fuel Type
0,1/2/2017,10000.0,1,7570.820,6609.600,G
1,1/2/2017,10001.0,1,12491.853,9338.736,D
2,1/2/2017,10002.0,1,NaN,NaN,NaN
3,1/2/2017,10002.0,2,17034.345,13377.824,D
4,1/2/2017,NaN,2,NaN,NaN,NaN

In [11]:
Invoices_df.isna().sum()

Invoice Date                     0
Invoice ID                      41
Invoice Gas Station Location     0
Gross Purchase Cost             42
Amount Purchased                42
Fuel Type                       42
dtype: int64

#### Fuel_Level_Part_1.csv

In [12]:
fuel_level_1_df.head()

  Tank ID  Fuel Level     Time stamp
0    T 12     27161.0  1/1/2017 0:10
1    T 12     27017.0  1/1/2017 0:25
2    T 12     26934.0  1/1/2017 0:40
3     T12         NaN  1/1/2017 0:45
4    T 12     26786.0  1/1/2017 0:55

In [13]:
fuel_level_1_df.isna().sum()

Tank ID       0
Fuel Level    2
Time stamp    0
dtype: int64

#### Fuel_Level_Part_2.csv

In [14]:
fuel_level_2_df.head()

  Tank ID  Fuel_Level      Timestamp
0    T 32       22327  1/1/2017 0:05
1    T 20       25215  1/1/2017 0:07
2    T 10       25700  1/1/2017 0:09
3    T 11       25685  1/1/2017 0:10
4    T 14       27138  1/1/2017 0:10

In [15]:
fuel_level_2_df.isna().sum()

Tank ID       0
Fuel_Level    0
Timestamp     0
dtype: int64